---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.ReverseIterator
source: html/9e86dca0-9318-db71-fbb2-50c9d776b38e.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual TemperatureRatingTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.